Repository: algorb/thbook_ru
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: Survey is the main data structure.
ru_ru: Survey -- основная структура данных.

source: Survey stations may be referenced in scraps etc.
ru_ru: На станции съемки можно ссылаться в скрабах и т.д.

source: Surveys may be nested---this allows a hierarchical structure to be built.
ru_ru: Survey могут быть вложенными -- это позволяет построить иерархическую структуру.

source: Surveys |a| -- |d| contain centreline data from four survey trips and each of them is in a separate file.
ru_ru: Surveys |a| -- |d| содержат данные нитки хода от четырех съемок, и каждый из них находится в отдельном файле.

source: Syntax is following: |<map reference> [<offset X> <offset Y> <units>] <above/below/none>| * scraps following the |break| will be placed on another level * |preview <above/below> <other map id>| will put the outline of the other map in the specified preview position relative to the current map.
ru_ru: Синтаксис следующий: |<название карты> [<смещение X> <смещение Y> <единицы>]|\break|<above/below/none>|. * скрапы после |break| будут размещены на другом уровне. * |preview <above/below> <идентификатор другой карты> | поместит контур другой карты в указанную позицию относительно текущей карты.

source: System command to delete files from the temporary directory.
ru_ru: Системная команда для удаления файлов из временного каталога;

source: TIP: Entering symbols of the same type at once saves you a lot of time because you need not change symbol type and fill options for each new symbol.
ru_ru: СОВЕТ. Ввод символов одного и того же типа одновременно экономит вам много времени, потому что вам не нужно менять тип символа и параметры заполнения для каждого нового символа.

source: Table and column names are self-explaining; for undefined or non-existing values |NULL| is used.
ru_ru: Названия таблиц и столбцов говорят сами за себя; для неопределенных или несуществующих значений используется |NULL|.

source: Table of Contents.
ru_ru: Содержание.

source: Take care not to click twice on the same place---you would insert two point symbols in the same place!
ru_ru: Старайтесь не нажимать дважды в одном месте -- тогда вы вставите два точечных символа в одном и том же месте!

source: Temporary data files are not shown.
ru_ru: Временные файлы данных не показаны.

source: Thanh, H. T.---Rahtz, S.---Hagen, H.: { The pdfuser manual}, available at {http://www.pdftex.org}
ru_ru: Thanh, H. T.--Rahtz, S.--Hagen, H.: { The pdfuser manual}, доступное на {http://www.pdftex.org}

source: Than click on the desired spot in the working area and you'll see a blue dot representing a point symbol.
ru_ru: Затем нажмите на нужное место в рабочей области, и вы увидите синюю точку, представляющую символ точки.

source: Than click somewhere else (this point will be the second point of the curve) and drag the mouse (adjusting the second control point of the previous arc and the first control point of the next one simultaneously.) If this explanation sounds too obscure, you can get some practise working in some of the standard vector editors with comprehensive documentation.
ru_ru: Затем нажмите где-нибудь еще (эта точка будет второй точкой кривой) и перетащите мышь (отрегулируйте вторую контрольную точку предыдущей дуги и первую контрольную точку следующего дуги, одновременно). Если это объяснение кажется слишком неясным, вы может поработать в некоторых стандартных векторных редакторах.

source: The "created" series is placed wrong on the map.
ru_ru: "Created" серия помещается неправильно на карте.

source: The macros are used inside of |code tex-atlas| part of the |layout| command (see the chapter { Processing data} for details).
ru_ru: макросы используются внутри |code tex-atlas| команды |layout| (подробнее смотрите главу { Обработка данных}).

source: The Quantity list can contain the following keywords: length, tape, bearing, compass, gradient, clino, counter, depth, x, y, z, position, easting, dx, northing, dy, altitude, dz.
ru_ru: |<Параметр>| может содержать\break следующие значения: length, tape, bearing, compass, gradient, clino, counter, depth, x, y, z, position, easting, dx, northing, dy, altitude, dz.

source: The alignment argument { A} is a pair representing ratios $(shift_x U_x)$ and $(shift_y U_y)$.
ru_ru: Аргумент alignment (выравнивание) { A}\break является парой значений, представляющих собой отношения $(shift_x U_x)$ и\break $(shift_y U_y)$.

source: The arguments are delimited as follows
ru_ru: Аргументы разделяются следующим образом:

source: The basic building block is the |centreline| command.
ru_ru: Основным блоком построения карт является команда |centreline|.

source: The basic one predefined by Therion is the
ru_ru: Основным определением Therion'а\break является макрос

source: The check-box { reverse} is important: Therion requires oriented curves and it is not unusual that you begin to draw from the wrong end.
ru_ru: Важным является чек-бокс { обратная}: Therion требует\break ориентированных кривых, и нет ничего необычного в том, что вы начинаете рисовать с неправильного конца.

source: The color and size of texts in the preformatted legend can be easily changed using ||, ||, || and || token registers, e.g. for large blue text:
ru_ru: Цвет и размер текстов в преформатированной легенде можно легко изменить, используя символьные регистры ||, ||, || и ||, например для большого синего текста:

source: The command has to be followed by paths specifying where regular, italic, bold, sans-serif and sans-serif oblique fonts are located in your system.
ru_ru: За\break командой должны следовать пути, указывающие, где в вашей системе расположены обычные, курсивные, полужирные, без засечек и наклонные без засечек шрифты.

source: The command |text| is not a Therion command!
ru_ru: Команда |text| -- это не команда Therion'а!

source: The computed declination is listed in the LOG file for information.
ru_ru: Вычисленное склонение указано для информации в файле LOG.

source: The configuration filename can be given as an argument to therion.
ru_ru: Имя конфигурационного файла можно указать в качестве аргумента для Therion'а.

source: The cover picture shows survey sketch of { Hrozny kame nolom} Chamber in the Cave of Dead Bats in Slovakia and the map of it produced by Therion.
ru_ru: На обложке изображен эскиз съемки грота { Hrozny kame nolom} в пещере Мертвых летучих мышей в Словакии и ее карта, созданная Therion'ом.

source: The cross section must be in the separate scrap with `none' projection specified.
ru_ru: Поперечное сечение должно быть в\break отдельном скрапе с проекцией `none'.

source: The current implementation creates a temporary directory named |thTMPDIR| (in your system temporary directory) and does not delete any temporary files.
ru_ru: Текущая реализация создает временный каталог с именем |thTMPDIR| (в вашем временном системном каталоге) и не удаляет временные файлы.

source: The custom attributes are used in map export depending on output format:
ru_ru: Пользовательские атрибуты используются при экспорте карты в\break зависимости от формата вывода:

source: The data files specify only what is where, not what it looks like.
ru_ru: В файлах данных\break указывается только то, что есть, а не то, на что это похоже.

source: The default setting may be changed using the |-clip option|, if this is allowed for particular symbol.
ru_ru: Значение по умолчанию может быть изменено с помощью опции |-clip|, если это разрешено для определенного символа.

source: The defaults are |8 10 12 16 24| for scales upto 1:100; |7 8 10 14 20| for scales upto 1:200; |6 7 8 10 14| for scales upto 1:500 and |5 6 7 8 10| for scales smaller than 1:500.
ru_ru: По умолчанию: |8 10 12 16 24| для шкал до 1:100; |7 8 10 14 20| для шкал до 1:200; |6 7 8 10 14| для шкал до 1:500 и |5 6 7 8 10| для шкал менее 1:500.

source: The drawing is just displayed on the background like scanned bitmaps and should be digitized manually.
ru_ru: Рисунок просто отображается на фоне как сканированное растровое изображение, и должен быть оцифрован вручную.

source: The file is commented; see the comments for details.
ru_ru: Файл комментирован; смотрите комментарии для подробностей.

source: The first argument is his/her name, the others describe the roles of the person in the team (optional---currently not used).
ru_ru: Первый аргумент -- его имя, остальные описывают роли человека в команде (необязательно -- в настоящее время не используется).

source: The following projection types are supported:
ru_ru: Поддерживаются следующие типы проекций:

source: The following role keywords are supported: station, length, tape, [back]compass, [back]bearing, [back]clino, [back]gradient, counter, depth, station, position, notes, pictures, pics, instruments (insts), assistant (dog).
ru_ru: Поддерживаются следующие\break зарезервированные слова: station (расстановка пикетов), length (измерение расстояния), tape (рулетка), [back]compass (компас), [back]bearing (азимут), [back]clino (угол наклона), [back]gradient (уклон), counter (счетчик), depth (глубина), position (позиция), notes (записи), pictures (изображения), pics (изображения), instruments (insts) (инструменты), assistant (dog)\break (помощник).

source: The following subtypes are supported for given types:
ru_ru: Для данных типов\break поддерживаются следующие подтипы:

source: The following subtypes for given types are supported:
ru_ru: Поддерживаются\break следующие подтипы для заданных типов:

source: The following types are supported:
ru_ru: Поддерживаются следующие типы:

source: The following values are accepted: center, c, top, t, bottom, b, left, l, right, r, top-left, tl, top-right, tr, bottom-left, bl, bottom-right, br.
ru_ru: Принимает следующие\break значения: center, c, top, t, bottom, b, left, l, right, r, top-left, tl, top-right, tr, bottom-left, bl, bottom-right, br.

source: The following variables are set at the beginning of the document:
ru_ru: Следующие переменные задаются в начале документа:

source: The frame style can be customized by redefining the || macro which defaults to |1 J 1 j 1.5 w|.
ru_ru: Стиль рамки можно настроить, переопределив макрос ||, который по умолчанию равен |1 J 1 j 1.5 w|.

source: The full contents of any command is displayed in the { Command preview} menu.
ru_ru: Полное содержимое любой команды отображается в меню { Просмотр\break команды}.

source: The full syntax is
ru_ru: Полный синтаксис

source: The general rule is that the free space is on the left, rock on the right.
ru_ru: Главное правило заключается в том, что свободное пространство хода находится слева по ходу линии (галочка направлена в эту сторону), а порода справа.

source: The header is aligned with the specified corner or side to this anchor point.
ru_ru: Заголовок выравнивается с указанным углом или сбоку от этой точки привязки.

source: The height and depth of the passage are computed from |passage-height| and |dimensions| point map symbols.
ru_ru: Высота и глубина хода\break вычисляются по символьным точкам |высота хода| (|passage-height|) и |размер хода| (|dimensions|).

source: The id stands for object identifier (the id of an object you want to revise must always be specified).
ru_ru: В качестве идентификатора всегда должен указываться идентификатор объекта, который вы хотите изменить.

source: The idea is simple: for each page Therion defines variables (count, token, and box registers) which contain the page elements (map, navigator, page name etc.).
ru_ru: Идея проста: для каждой страницы Therion определяет переменные (count, token и box registers), которые содержат элементы страницы (карта, навигатор, название страницы и т.д.).

source: The index can be any keyword.
ru_ru: Индекс может быть любым ключевым словом.\break

source: The initialization file is read like any other therion file.
ru_ru: Файл инициализации читается как любой другой файл.

source: The input files for Therion are in text format.
ru_ru: Входные файлы для Therion'а имеют текстовый формат.

source: The length includes shots with |approximate| flags, but not |explored|, |duplicate| or |surface|.
ru_ru: Длина включает замеры с флагами |approximate|, но не с флагами |explored|, |duplicate| или |surface|.

source: The line will be finished after escaping from the insertion mode.
ru_ru: Линия будет завершена после выхода из режима вставки.

source: The list may contain page numbers separated by a comma or dash (for intervals) e.g. |2,4-7,9,23| means, that pages 2, 4, 5, 6, 7, 9 and 23 should be omitted.
ru_ru: Список может содержать номера страниц, разделенные запятой или тире (для интервалов), например, |2,4-7,9,23| означает, что страницы 2, 4, 5, 6, 7, 9 и 23 должны не выводиться.

source: The list of currently supported encodings gives the |--print-tex-encodings| command line option.
ru_ru: Список поддерживаемых в настоящее время кодировок выводится опцией |--print-tex-encodings| в командной\break строке.

source: The map warping model was substantially different from the current one (positions of features were relative to a particular survey shot, not to positions of all stations in a scrap).
ru_ru: Модель деформации карты существенно отличалась от текущей\break (позиции характеристик были относительно конкретного съемного\break замера, а не позиции всех станций в скрапе).

source: The maximal and average scrap distortions are calculated as a maximum or average of such measures applied to all pairs of points.
ru_ru: Максимальные и средние искажения скрапа вычисляются как максимальные или средние значения таких мер, применяемых ко всем парам точек.

source: The measure is calculated as $ d_a-d_b d_b$, where $d_b$ is the distance of points before warping and $d_a$ is the distance of points after warping.
ru_ru: Мера рассчитывается как $ d_a-d_b d_b$, где $d_b$ -- это расстояние до деформирования, а $d_a$ -- расстояние до точек после деформирования.

source: The measured value is calculated using the following formula: $measuredvalue = (readvalue - zeroerror) scale$.
ru_ru: Измеренное значение рассчитывается по следующей формуле: $измеренноезначение = (прочитанноезначение - ошибка) масштаб$.\break

source: The model is created from scrap outlines.
ru_ru: Модель создается из внешних линий скрапов.

source: The most important thing is to devise division of the cave into scraps.
ru_ru: Самое главное -- придумать деление пещеры на скрапы.

source: The next line (``|smooth off|'') specifies an option which applies to subsequent data (i.e. not for the whole line, unlike the option |-id| in the first line) and the last line contains some more data.
ru_ru: Следующая строка (``|smooth off|'') указывает параметр, который применяется к последующим данным (т.е. не для всей линии, в отличие от опции |-id| в первой строке), и последняя строка содержит еще несколько данных.

source: The next two lines contain data (coordinates of Bezier curves to be drawn).
ru_ru: Следующие две строки содержат данные (координаты кривых Безье).

source: The numeric value can be optionally followed by `|?|', if the value is presumed and units can be added (e.g. |-value [40?
ru_ru: Числовое значение может сопровождаться необязательным символом `|?|', чтобы добавить единицы измерения (например |-value [40?

source: The only exception is the base set of Computer Modern fonts, which use `raw' encoding.
ru_ru: Единственным исключением является базовый набор\break шрифтов Computer Modern, который использует `сырую' кодировку.

source: The only thing that is missing is connection line between stations 1 in these two branches.
ru_ru: Единственное, чего не хватает, это линия соединения между станциями 1 в этих двух нитках.

source: The order of submenus on the side may be customized by the user.
ru_ru: Показ подменю сбоку может быть настроен пользователем.

source: The points with distance changed most during transformation are displayed orange.
ru_ru: Точечные символы, расположение которых больше всего изменились во время преобразования, отображаются оранжевым цветом.

source: The reason is that connections between scraps should be as simple as possible.
ru_ru: Причина в том, что соединения между скрапами должны быть как можно более простыми.

source: The result is displayed red if |debug| option of the |layout| command is set |on|.
ru_ru: Результат отображается красным цветом, если опция |debug| в команде |layout| установлена в |on|.

source: The result is final map.
ru_ru: Результат -- готовая карта.

source: The result is horizontal/vertical line segment).
ru_ru: Результат --\break горизонтальный/вертикальный сегмент линии).

source: The same as the |select| command.
ru_ru: Так же, как и в команде |select|.

source: The same encoding must be used while generating metrics (|*.tfm| files) for those fonts (e.g. with the afm2tfm program) and this encoding must be explicitly given also in the pdf's map file.
ru_ru: Та же кодировка должна использоваться при генерации \break метрик (|*.tfm| файлов) для этих шрифтов (например, с использованием программы afm2tfm), и эта кодировка должна быть явно указана в файле карты в pdf.

source: The same file is used for both imports.
ru_ru: Тот же файл\break используется для обоих импортов.

source: The same should be done for the italic and bold faces and corresponding sans-serif and sans-serif-oblique fonts.
ru_ru: То же самое должно быть сделано для курсивых и полужирных шрифтов и соответствующих шрифтов без засечек и\break наклонных без засечек.

source: The scale can be defined only one way in XTherion---using coordinates of two points (specified both in the picture coordinate system and in the `real' coordinate system).
ru_ru: Масштаб можно определить только одним способом в XTherion'е -- используя координаты двух точек (заданных как в системе координат изображения, так и в `реальной' системе координат).

source: The size and zoom setting of the { drawing area} is adjusted in the corresponding menu.
ru_ru: Размер и масштабирование {области рисования} настраивается в\break соответствующем меню.

source: The source code is a primary Therion distribution.
ru_ru: Исходники -- главный дистрибутив Therion'а.

source: The submenus may be packed; you may unpack them by clicking on the menu button.
ru_ru: Подменю могут быть свернуты; вы можете развернуть их, нажав кнопку меню.

source: The subtype may be specified also directly in |<type>| specification using `|:|' as a separator.E.g. |border:invisible|]
ru_ru: Подтип может быть указан также непосредственно в |<типе>| с\break использованием `|:|' в качестве разделителяНапример, |border:invisible|.].

source: The subtype may be specified also directly in |<type>| specification using `|:|' as a separator.E.g. |station:fixed|]
ru_ru: Подтип может быть указан также непосредственно в |<type>| с\break использованием `|:|' в качестве разделителяНапример, |station:fixed|.].

source: The supported flags are: |surface| (for surface measurements), |duplicate| (for duplicated surveys), |splay| (for short side legs that are hidden in maps and models by default).
ru_ru: Поддерживаемые флаги: |surface| (для измерений на поверхности),\break |duplicate| (для дублированных съемок), |splay| (для коротких боковых\break замеров, которые по умолчанию скрыты на картах и моделях).

source: The supported quantities are the same as sd.
ru_ru: Поддерживаемые единицы такие же, как в sd.

source: The survey stations names will be referenced using |@| symbol (e.g. |1@a|) in the scraps.If you include maps in the top-level survey, you may reference any survey station in any scrap, which is very flexible.
ru_ru: Названия станций survey будут иметь символ |@| (например, |1@a|)Если вы подключаете файлы карт в начале survey, вы можете ссылаться на любую станцию в любом скрапе, что представляет собой очень гибким инструмент.

source: The symbol should be centered at the coordinates' origin.
ru_ru: Символ должен быть центрирован в начале координат.

source: The syntax is
ru_ru: Синтаксис:

source: The syntax is borrowed from Survex with minor modifications; the Survex manual may be useful as an additional reference for the user.
ru_ru: Синтаксис заимствован из Survex с небольшими изменениями; руководство Survex может быть полезно в\break качестве дополнительной справки для использования.

source: The syntax is very simple.
ru_ru: Синтаксис очень прост.

source: The syntax of input files is described in detail in later chapters.
ru_ru: Синтаксис входных файлов подробно описан в последующих главах.

source: The syntax of input files is explained in the description of individual commands.
ru_ru: Синтаксис входных файлов объясняется в описании отдельных команд.\break

source: The syntax of these is
ru_ru: Их синтаксис

source: The syntax of this command for object created with ``single line'' command is
ru_ru: Синтаксис этой команды для объекта, созданного с помощью команды\break ``single line'':

source: The transformation consists of the following steps: * Linear transformation (shifting, scaling and rotation) which `best' fits stations drawn in the scrap to real ones.
ru_ru: Трансформация состоит из следующих шагов: * линейное преобразование (смещение, масштабирование и вращение),\break которые 'лучше всего' соответствуют станциям.

source: The translation file should contain two hexadecimal values of a character (first one in the 8-bit encoding, second one in Unicode) in each line.
ru_ru: Файл перевода должен содержать два шестнадцатеричных символа (первый в 8-разрядной кодировке, второй в Unicode) в каждой строке.

source: The type and other attributes of any object are specified only in the { Point control} and { Line control} menus.
ru_ru: Тип и другие атрибуты любого объекта указываются только в меню { Точка} и { Линия}.

source: The ultimate reference for plain is
ru_ru: Подробнее о plain смотрите в

source: The value can be prefixed by a keyword ``|fix|'', then no nearest station is taken into consideration; the absolute given value is used instead.
ru_ru: Значение может иметь префикс с ключевым словом ``|fix|'', тогда никакая ближайшая станция не будет принята во внимание; вместо этого\break используется абсолютное заданное значение.

source: The value can optionally be followed by length units.
ru_ru: Значение может сопровождаться единицами измерения.

source: The visual representation is added by in later phases of data processing.
ru_ru: Визуальное представление добавляется на более поздних этапах обработки данных

source: The { survey} context means that the command must be enclosed by |survey ... endsurvey| pair.
ru_ru: Контекст { survey} означает, что команда должна быть заключена в пару\break |survey ... endsurvey|.

source: The { scrap} context means that the command must be enclosed within |scrap ... endscrap| pair.
ru_ru: Контекст { scrap} означает, что команда должна быть заключена в пару |scrap ... endscrap|.

source: The { Line point control} menu enables you to adjust the attributes of any selected point on the line, such as the curve being smooth at this point (which is on by default), or the presence of neighbouring control points (`|<<|' and `|>>|' check-boxes).
ru_ru: Меню { Точка линии} позволяет вам\break отрегулировать атрибуты любой выбранной точки на линии, например,\break сглаживание кривой в этой точке (которая включена по умолчанию) или наличие соседних контрольных точек (`|<<|' и `|>>|').

source: The |<specification>| has four forms:
ru_ru: |<Спецификация>| имеет четыре формы:

source: The |<specification>| has three forms:
ru_ru: |<Спецификация>| имеет три формы:

source: The || macro has four parameters: coordinates ranging 0--100, alignment specification (N, E, S, W, NE, SE, SW, NW or C) and the content to be displayed.
ru_ru: Макрос ||\break имеет четыре параметра: координаты в диапазоне 0--100, спецификация выравнивания (N, E, S, W, NE, SE, SW, NW или C) и отображаемый контент.
